base
linux
linux-firmware
seatd
dbus
polkit
polkit-gnome
xorg-xwayland
sway
swayfx
swayidle
swaync
wlroots
libinput
wayland
wayland-protocols
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-utils
pipewire
pipewire-audio
pipewire-pulse
pipewire-alsa
wireplumber
alsa-utils
pamixer
playerctl
NetworkManager
network-manager-applet
bluez
bluez-utils
waybar
rofi-wayland
wl-clipboard
cliphist
kitty
kitty-terminfo
zsh
dolphin
gvfs
udiskie
grim
slurp
satty
brightnessctl
swaylock
wlogout
swww
swww-daemon
cairo
kvantum
qt5ct
qt6ct
nwg-look
ttf-dejavu
ttf-jetbrains-mono
noto-fonts
noto-fonts-emoji
adwaita-icon-theme
ttf-jetbrains-mono-nerd
btop
fastfetch
cava
librewolf
flatpak
git
cmake
xdg-desktop-portal
xdg-desktop-portal-gtk
libsecret
acpid
code
spotify-launcher
vesktop
procps
jq