acpid
alsa-utils
base
base-devel
bluez
bluez-utils
brightnessctl
btop
cairo
cava
cliphist
cmake
dbus
dolphin
dunst
kitty
kitty-terminfo
kvantum
fastfetch
flatpak
git
grim
gvfs
hyprlock
libinput
libsecret
librewolf
NetworkManager
network-manager-applet
nwg-look
pamixer
pipewire
playerctl
polkit-gnome
qt5ct
qt6ct
rofi-wayland
satty
seatd
slurp
swayfx
hyprlock
swww
swww-daemon
sway
swayidle
udiskie
waybar
wl-clipboard
wlogout
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-utils
xorg-xwayland
zsh